app/controllers/items_controller.rb

  def index
    if user_signed_in?
      @items = Item.where(:user_id => current_user.id).order("created_at DESC")
---
SELECT "items".* FROM "items" WHERE "items"."user_id" = ? ORDER BY created_at DESC  [["user_id", 1]]

  def create
    @item = current_user.items.build(item_params)
    #@item = Item.new(params.require(:item).permit(:title, :description))
    if @item.save
---
INSERT INTO "items" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "Conquistar Trono de Ferro"], ["description", "Matar a Danny e Cersei"], ["created_at", "2019-06-12 19:49:23.948347"], ["updated_at", "2019-06-12 19:49:23.948347"], ["user_id", 2]]

  def update
    if @item.update(item_params)
---
UPDATE "items" SET "description" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["description", "Fabin Soares"], ["updated_at", "2019-06-12 16:53:03.766704"], ["id", 7]]

  def destroy
    @item.destroy
---
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 8]]

  def complete
    @item = Item.find(params[:id])
    @item.update_attribute(:completed_at, Time.now)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "items" SET "completed_at" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["completed_at", "2019-06-12 20:12:18.910098"], ["updated_at", "2019-06-12 20:12:18.910956"], ["id", 9]]

    def find_item
      @item = Item.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]